martin8947/mcux_stage/mcxw_stage/drivers/fsl_edma.c
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2022, 2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_edma.h"
#if defined FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
#include "fsl_memory.h"
#endif

/*
 * $Coverage Justification Reference$
 *
 * $Justification edma_c_ref_1$
 * The peripheral base address is always valid and checked by assert.
 *
 * $Justification edma_c_ref_2$
 * (tcdRegs->DLAST_SGA == temp) not covered.
 * The change of DLAST_SGA register value is too short not to catch.
 *
 * $Justification edma_c_ref_3$
 * (tcdRegs->CSR & DMA_TCD_CSR_ESG_MASK) != 0u) not covered.
 * When done mask not set, the esg mask will not be set too.
 *
 * $Justification edma_c_ref_4$
 * (sga_index != 0U) not covered.
 * The sga_index != 0U always true when transfer_done is 0;
 *
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.dma3"
#endif

#define EDMA_TRANSFER_ENABLED_MASK 0x80U

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*!
 * @brief Get instance number for EDMA.
 *
 * @param base EDMA peripheral base address.
 */
static uint32_t EDMA_GetInstance(DMA_Type *base);

/*!
 * @brief Configure tcd contents accroding to the configure.
 *
 * @param handle edma handle pointer.
 * @param channel EDMA channel number.
 * @param config EDMA configure pointer.
 * @param nextTcd Point to next TCD structure if there is.
 */
static void EDMA_HandleTransferConfig(edma_handle_t *handle,
                                      uint32_t channel,
                                      const edma_transfer_config_t *config,
                                      edma_tcd_t *nextTcd);

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*! @brief Array to map EDMA instance number to base pointer. */
static DMA_Type *const s_edmaBases[] = DMA_BASE_PTRS;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
#if (defined(FSL_FEATURE_EDMA_HAS_COMMON_CLOCK_GATE) && (FSL_FEATURE_EDMA_HAS_COMMON_CLOCK_GATE))
/*! @brief Array to map EDMA instance number to clock name. */
static const clock_ip_name_t s_edmaClockName[] = EDMA_CLOCKS;
#endif /* FSL_FEATURE_EDMA_HAS_COMMON_CLOCK_GATE */
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

#if defined(DMA_IRQS)
static const IRQn_Type s_edmaIRQNumber[][FSL_FEATURE_EDMA_MODULE_CHANNEL] = DMA_IRQS;
#endif

/*! @brief Pointers to transfer handle for each EDMA channel. */
static edma_handle_t *s_EDMAHandle[FSL_FEATURE_EDMA_MODULE_CHANNEL * FSL_FEATURE_SOC_EDMA_COUNT];

/*! @brief EDMA enabled channel. */
static bool s_EDMAEnabledChannel[FSL_FEATURE_SOC_EDMA_COUNT][FSL_FEATURE_EDMA_MODULE_CHANNEL];
/*******************************************************************************
 * Code
 ******************************************************************************/

static uint32_t EDMA_GetInstance(DMA_Type *base)
{
    uint32_t instance;

    /* Find the instance index from base address mappings. */
    /*
     * $Branch Coverage Justification$
     * (instance >= ARRAY_SIZE(s_edmaBases)) not covered.
     * $ref edma_c_edma_1$.
     */
    for (instance = 0; instance < ARRAY_SIZE(s_edmaBases); instance++)
    {
        /*
         * $Branch Coverage Justification$
         * (s_edmaBases[instance] != base) not covered.
         * $ref edma_c_ref_1$.
         */
        if (MSDK_REG_SECURE_ADDR(s_edmaBases[instance]) == MSDK_REG_SECURE_ADDR(base))
        {
            break;
        }
    }

    assert(instance < ARRAY_SIZE(s_edmaBases));

    return instance;
}

void EDMA_InstallTCD(DMA_Type *base, uint32_t channel, edma_tcd_t *tcd)
{
    assert(channel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);
    assert(tcd != NULL);
    assert(((uint32_t)tcd & 0x1FU) == 0U);

    /* Push tcd into hardware TCD register */
    base->CH[channel].TCD_SADDR          = tcd->SADDR;
    base->CH[channel].TCD_SOFF           = tcd->SOFF;
    base->CH[channel].TCD_ATTR           = tcd->ATTR;
    base->CH[channel].TCD_NBYTES_MLOFFNO = tcd->NBYTES;
    base->CH[channel].TCD_SLAST_SDA      = tcd->SLAST;
    base->CH[channel].TCD_DADDR          = tcd->DADDR;
    base->CH[channel].TCD_DOFF           = tcd->DOFF;
    base->CH[channel].TCD_CITER_ELINKNO  = tcd->CITER;
    base->CH[channel].TCD_DLAST_SGA      = tcd->DLAST_SGA;
    /* Clear DONE bit first, otherwise ESG cannot be set */
    base->CH[channel].TCD_CSR           = 0;
    base->CH[channel].TCD_CSR           = tcd->CSR;
    base->CH[channel].TCD_BITER_ELINKNO = tcd->BITER;
}

static void EDMA_HandleTransferConfig(edma_handle_t *handle,
                                      uint32_t channel,
                                      const edma_transfer_config_t *config,
                                      edma_tcd_t *nextTcd)
{
    assert((handle != NULL) && (config != NULL));

/* If there is address offset, convert the address */
#if defined FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
    nextTcd = (edma_tcd_t *)(MEMORY_ConvertMemoryMapAddress((uint32_t)nextTcd, kMEMORY_Local2DMA));
#endif /* FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET */
    EDMA_SetTransferConfig(handle->base, channel, config, nextTcd);
}

/*!
 * brief Initializes the eDMA peripheral.
 *
 * This function ungates the eDMA clock and configures the eDMA peripheral
 * according
 * to the configuration structure.
 *
 * param base eDMA peripheral base address.
 * param config A pointer to the configuration structure, see "edma_config_t".
 * note This function enables the minor loop map feature.
 */
void EDMA_Init(DMA_Type *base, const edma_config_t *config)
{
    assert(config != NULL);

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
#if (defined(FSL_FEATURE_EDMA_HAS_COMMON_CLOCK_GATE) && (FSL_FEATURE_EDMA_HAS_COMMON_CLOCK_GATE))
    CLOCK_EnableClock(s_edmaClockName[EDMA_GetInstance(base)]);
#endif /* FSL_FEATURE_EDMA_HAS_COMMON_CLOCK_GATE */
#endif /* FSL_FEATURE_EDMA_HAS_CLOCK_GATE */

#if defined(FSL_FEATURE_HAVE_DMA_CONTROL_REGISTER_ACCESS_PERMISSION) && \
    FSL_FEATURE_HAVE_DMA_CONTROL_REGISTER_ACCESS_PERMISSION
    uint32_t tmpreg;
    /* Configure EDMA peripheral according to the configuration structure. */
    tmpreg = base->MP_CSR;
    tmpreg &= ~(DMA_MP_CSR_HAE_MASK | DMA_MP_CSR_ERCA_MASK | DMA_MP_CSR_EDBG_MASK);

