martin8947/mcux_stage/mcxw_stage/drivers/fsl_edma.c
    EDMA_PrepareTransferConfig(config, srcAddr, srcWidth, srcOffset, destAddr, destWidth, destOffset, bytesEachRequest,
                               transferBytes);
}

/*!
 * brief Submits the eDMA transfer request.
 *
 * This function submits the eDMA transfer request according to the transfer
 * configuration structure.
 * If submitting the transfer request repeatedly, this function packs an
 * unprocessed request as
 * a TCD and enables scatter/gather feature to process it in the next time.
 *
 * param handle eDMA handle pointer.
 * param config Pointer to eDMA transfer configuration structure.
 * retval kStatus_EDMA_Success It means submit transfer request succeed.
 * retval kStatus_EDMA_QueueFull It means TCD queue is full. Submit transfer
 * request is not allowed.
 * retval kStatus_EDMA_Busy It means the given channel is busy, need to submit
 * request later.
 */
status_t EDMA_SubmitTransfer(edma_handle_t *handle, const edma_transfer_config_t *config)
{
    assert(handle != NULL);
    assert(config != NULL);

    edma_tcd_t *tcdRegs = (edma_tcd_t *)((uint32_t)&handle->base->CH[handle->channel] + 0x00000020U);

    if (handle->tcdPool == NULL)
    {
        /*
            Check if EDMA is busy: if major loop count is not zero, then the channel is busying transfer
        */
        if (EDMA_GetRemainingMajorLoopCount(handle->base, handle->channel) != 0U)
        {
            return kStatus_EDMA_Busy;
        }
        else
        {
            EDMA_HandleTransferConfig(handle, handle->channel, config, NULL);
            /* Enable auto disable request feature */
            handle->base->CH[handle->channel].TCD_CSR |= DMA_TCD_CSR_DREQ_MASK;
            /* Enable major interrupt */
            handle->base->CH[handle->channel].TCD_CSR |= DMA_TCD_CSR_INTMAJOR_MASK;

            return kStatus_Success;
        }
    }
    else /* Use the TCD queue. */
    {
        uint32_t primask;
        uint16_t csr;
        int8_t currentTcd;
        int8_t previousTcd;
        int8_t nextTcd;
        uint32_t temp = 0;

        /* Check if tcd pool is full. */
        primask = DisableGlobalIRQ();
        if (handle->tcdUsed >= handle->tcdSize)
        {
            EnableGlobalIRQ(primask);

            return kStatus_EDMA_QueueFull;
        }
        currentTcd = handle->tail;
        handle->tcdUsed++;
        /* Calculate index of next TCD */
        nextTcd = currentTcd + 1;
        if (nextTcd == handle->tcdSize)
        {
            nextTcd = 0;
        }
        /* Advance queue tail index */
        handle->tail = nextTcd;
        EnableGlobalIRQ(primask);
        /* Calculate index of previous TCD */
        previousTcd = currentTcd != 0 ? currentTcd - 1 : handle->tcdSize - 1;
        /* Configure current TCD block. */
        EDMA_TcdReset(&handle->tcdPool[currentTcd]);

        EDMA_TcdSetTransferConfig(&handle->tcdPool[currentTcd], config, NULL);
        /* Enable major interrupt */
        handle->tcdPool[currentTcd].CSR |= DMA_TCD_CSR_INTMAJOR_MASK;
/* Link current TCD with next TCD for identification of current TCD */
/* If defined TCM offet, do a offset to the address */
#if defined FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
        temp = MEMORY_ConvertMemoryMapAddress((uint32_t)&handle->tcdPool[nextTcd], kMEMORY_Local2DMA);
#else
        temp = (uint32_t)&handle->tcdPool[nextTcd];
#endif /* FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET */
        handle->tcdPool[currentTcd].DLAST_SGA = temp;
        /* Chain from previous descriptor unless tcd pool size is 1(this descriptor
         * is its own predecessor). */
        if (currentTcd != previousTcd)
        {
            /* Enable scatter/gather feature in the previous TCD block. */
            csr =
                (handle->tcdPool[previousTcd].CSR | (uint16_t)DMA_TCD_CSR_ESG_MASK) & ~(uint16_t)DMA_TCD_CSR_DREQ_MASK;
            handle->tcdPool[previousTcd].CSR = csr;
/*
    Check if the TCD block in the registers is the previous one (points to
   current TCD block). It
    is used to check if the previous TCD linked has been loaded in TCD register.
   If so, it need to
    link the TCD register in case link the current TCD with the dead chain when
   TCD loading occurs
    before link the previous TCD block.
*/
#if defined FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
            temp = MEMORY_ConvertMemoryMapAddress((uint32_t)&handle->tcdPool[currentTcd], kMEMORY_Local2DMA);
#else
            temp = (uint32_t)&handle->tcdPool[currentTcd];
#endif /* FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET */
            if (tcdRegs->DLAST_SGA == temp)
            {
                /* Enable scatter/gather also in the TCD registers. */
                csr = (tcdRegs->CSR | (uint16_t)DMA_TCD_CSR_ESG_MASK) & ~(uint16_t)DMA_TCD_CSR_DREQ_MASK;
                /* Must write the CSR register one-time, because the transfer maybe
                 * finished anytime. */
                tcdRegs->CSR = csr;
                /*
                    It is very important to check the ESG bit!
                    Because this hardware design: if DONE bit is set, the ESG bit can
                   not be set. So it can
                    be used to check if the dynamic TCD link operation is successful. If
                   ESG bit is not set
                    and the DLAST_SGA is not the next TCD address(it means the dynamic
                   TCD link succeed and
                    the current TCD block has been loaded into TCD registers), it means
                   transfer finished
                    and TCD link operation fail, so must install TCD content into TCD
                   registers and enable
                    transfer again. And if ESG is set, it means transfer has
                   notfinished, so TCD dynamic
                    link succeed.
                */
                if ((tcdRegs->CSR & DMA_TCD_CSR_ESG_MASK) != 0U)
                {
                    return kStatus_Success;
                }
/*
    Check whether the current TCD block is already loaded in the TCD registers.
   It is another
    condition when ESG bit is not set: it means the dynamic TCD link succeed and
   the current
    TCD block has been loaded into TCD registers.
*/
#if defined FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
                temp = MEMORY_ConvertMemoryMapAddress((uint32_t)&handle->tcdPool[nextTcd], kMEMORY_Local2DMA);
#else
                temp = (uint32_t)&handle->tcdPool[nextTcd];
#endif /* FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET */
                /*
                 * $Branch Coverage Justification$
                 * (tcdRegs->DLAST_SGA == temp) not covered.
                 * $ref edma_c_ref_2$.
                 */
                if (tcdRegs->DLAST_SGA == temp)
                {
                    /*
                     * $Line Coverage Justification$
                     * $ref edma_c_ref_2$.
                     */
                    return kStatus_Success;
                }
                /*
                    If go to this, means the previous transfer finished, and the DONE
                   bit is set.
                    So shall configure TCD registers.
                */
            }
            else if (tcdRegs->DLAST_SGA != 0U)
            {
                /* The current TCD block has been linked successfully. */
                return kStatus_Success;
            }
            else
            {
                /*
                    DLAST_SGA is 0 and it means the first submit transfer, so shall
                   configure
                    TCD registers.
                */
            }
        }
        /* There is no live chain, TCD block need to be installed in TCD registers.
         */
        EDMA_InstallTCD(handle->base, handle->channel, &handle->tcdPool[currentTcd]);
        /* Enable channel request again. */
        if ((handle->flags & EDMA_TRANSFER_ENABLED_MASK) != 0U)
        {
            handle->base->CH[handle->channel].CH_CSR =
                (handle->base->CH[handle->channel].CH_CSR & (~DMA_CH_CSR_DONE_MASK)) | DMA_CH_CSR_ERQ_MASK;
        }

        return kStatus_Success;
    }
}

/*!
 * brief eDMA starts transfer.
 *
 * This function enables the channel request. Users can call this function after
 * submitting the transfer request
 * or before submitting the transfer request.
 *
 * param handle eDMA handle pointer.
 */
void EDMA_StartTransfer(edma_handle_t *handle)
{
    assert(handle != NULL);

    if (handle->tcdPool == NULL)
    {
        handle->base->CH[handle->channel].CH_CSR =
            (handle->base->CH[handle->channel].CH_CSR & (~DMA_CH_CSR_DONE_MASK)) | DMA_CH_CSR_ERQ_MASK;
    }
    else /* Use the TCD queue. */
    {
        uint32_t primask;
        edma_tcd_t *tcdRegs = (edma_tcd_t *)((uint32_t)&handle->base->CH[handle->channel] + 0x00000020U);

