martin8947/mcux_stage/mcxw_stage/drivers/fsl_edma.c
    SDK_ISR_EXIT_BARRIER;
}
#endif

#if defined(FSL_FEATURE_EDMA_MODULE_CHANNEL_IRQ_ENTRY_SUPPORT_PARAMETER) && \
    (FSL_FEATURE_EDMA_MODULE_CHANNEL_IRQ_ENTRY_SUPPORT_PARAMETER)
void DMA0_DriverIRQHandler(uint32_t channel);
void DMA0_DriverIRQHandler(uint32_t channel)
{
    uint32_t instance    = EDMA_GetInstance(DMA0);
    uint32_t prevChannel = (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL * instance;

    if ((EDMA_GetChannelStatusFlags(DMA0, channel) & (uint32_t)kEDMA_InterruptFlag) != 0U)
    {
        EDMA_HandleIRQ(s_EDMAHandle[prevChannel + channel]);
    }

    SDK_ISR_EXIT_BARRIER;
}
#else
#ifdef DMA0
void DMA0_DriverIRQHandler(void);
void DMA0_DriverIRQHandler(void)
{
    uint32_t channel = FSL_FEATURE_EDMA_MODULE_CHANNEL;
    uint32_t i = 0;
    uint32_t instance = EDMA_GetInstance(DMA0);
    uint32_t prevChannel = (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL * instance;

#if defined FSL_FEATURE_EDMA_INSTANCE_CHANNELn
    channel = FSL_FEATURE_EDMA_INSTANCE_CHANNELn(DMA0);
#endif

    for (i = 0; i < channel; i++)
    {
        if (s_EDMAEnabledChannel[instance][i])
        {
            /*
             * $Branch Coverage Justification$
             * (EDMA_GetChannelStatusFlags(DMA0, i) & (uint32_t)kEDMA_InterruptFlag) == 0U) not covered. Test
             * unfeasible, the Reference interrupt flag state is too short to catch.
             */
            if ((EDMA_GetChannelStatusFlags(DMA0, i) & (uint32_t)kEDMA_InterruptFlag) != 0U)
            {
                EDMA_HandleIRQ(s_EDMAHandle[prevChannel + i]);
            }
        }
    }
    SDK_ISR_EXIT_BARRIER;
}
#endif

#ifdef ADMA__EDMA0
void ADMA_EDMA0_INT_DriverIRQHandler(void);
void ADMA_EDMA0_INT_DriverIRQHandler(void)
{
    uint32_t channel = FSL_FEATURE_EDMA_MODULE_CHANNEL;
    uint32_t i = 0;
    DMA_Type *base = ADMA__EDMA0;
    uint32_t instance = EDMA_GetInstance(base);
    uint32_t prevChannel = (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL * instance;

#if defined FSL_FEATURE_EDMA_INSTANCE_CHANNELn
    channel = (uint32_t)FSL_FEATURE_EDMA_INSTANCE_CHANNELn(base);
#endif

    for (i = 0; i < channel; i++)
    {
        if (s_EDMAEnabledChannel[instance][i])
        {
            if ((EDMA_GetChannelStatusFlags(base, i) & (uint32_t)kEDMA_InterruptFlag) != 0U)
            {
                EDMA_HandleIRQ(s_EDMAHandle[prevChannel + i]);
            }
        }
    }
    SDK_ISR_EXIT_BARRIER;
}
#endif

#ifdef ADMA__EDMA1
void ADMA_EDMA1_INT_DriverIRQHandler(void);
void ADMA_EDMA1_INT_DriverIRQHandler(void)
{
    uint32_t channel = FSL_FEATURE_EDMA_MODULE_CHANNEL;
    uint32_t i = 0;
    DMA_Type *base = ADMA__EDMA1;
    uint32_t instance = EDMA_GetInstance(base);
    uint32_t prevChannel = (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL * instance;

#if defined FSL_FEATURE_EDMA_INSTANCE_CHANNELn
    channel = (uint32_t)FSL_FEATURE_EDMA_INSTANCE_CHANNELn(base);
#endif

    for (i = 0; i < channel; i++)
    {
        if (s_EDMAEnabledChannel[instance][i])
        {
            if ((EDMA_GetChannelStatusFlags(base, i) & (uint32_t)kEDMA_InterruptFlag) != 0U)
            {
                EDMA_HandleIRQ(s_EDMAHandle[prevChannel + i]);
            }
        }
    }
    SDK_ISR_EXIT_BARRIER;
}
#endif

#ifdef ADMA__EDMA2
void ADMA_EDMA2_INT_DriverIRQHandler(void);
void ADMA_EDMA2_INT_DriverIRQHandler(void)
{
    uint32_t channel = FSL_FEATURE_EDMA_MODULE_CHANNEL;
    uint32_t i = 0;
    DMA_Type *base = ADMA__EDMA2;
    uint32_t instance = EDMA_GetInstance(base);
    uint32_t prevChannel = (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL * instance;

#if defined FSL_FEATURE_EDMA_INSTANCE_CHANNELn
    channel = (uint32_t)FSL_FEATURE_EDMA_INSTANCE_CHANNELn(base);
#endif

    for (i = 0; i < channel; i++)
    {
        if (s_EDMAEnabledChannel[instance][i])
        {
            if ((EDMA_GetChannelStatusFlags(base, i) & (uint32_t)kEDMA_InterruptFlag) != 0U)
            {
                EDMA_HandleIRQ(s_EDMAHandle[prevChannel + i]);
            }
        }
    }
    SDK_ISR_EXIT_BARRIER;
}
#endif

#ifdef ADMA__EDMA3
void ADMA_EDMA3_INT_DriverIRQHandler(void);
void ADMA_EDMA3_INT_DriverIRQHandler(void)
{
    uint32_t channel = FSL_FEATURE_EDMA_MODULE_CHANNEL;
    uint32_t i = 0;
    DMA_Type *base = ADMA__EDMA3;
    uint32_t instance = EDMA_GetInstance(base);
    uint32_t prevChannel = (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL * instance;

#if defined FSL_FEATURE_EDMA_INSTANCE_CHANNELn
    channel = (uint32_t)FSL_FEATURE_EDMA_INSTANCE_CHANNELn(base);
#endif

    for (i = 0; i < channel; i++)
    {
        if (s_EDMAEnabledChannel[instance][i])
        {
            if ((EDMA_GetChannelStatusFlags(base, i) & (uint32_t)kEDMA_InterruptFlag) != 0U)
            {
                EDMA_HandleIRQ(s_EDMAHandle[prevChannel + i]);
            }
        }
    }
    SDK_ISR_EXIT_BARRIER;
}
#endif

#ifdef AUDIO__EDMA0
void AUDIO_EDMA0_INT_DriverIRQHandler(void);
void AUDIO_EDMA0_INT_DriverIRQHandler(void)
{
    uint32_t channel = FSL_FEATURE_EDMA_MODULE_CHANNEL;
    uint32_t i = 0;
    DMA_Type *base = AUDIO__EDMA0;
    uint32_t instance = EDMA_GetInstance(base);
    uint32_t prevChannel = (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL * instance;

#if defined FSL_FEATURE_EDMA_INSTANCE_CHANNELn
    channel = (uint32_t)FSL_FEATURE_EDMA_INSTANCE_CHANNELn(base);
#endif
    for (i = 0; i < channel; i++)
    {
        if (s_EDMAEnabledChannel[instance][i])
        {
            if ((EDMA_GetChannelStatusFlags(AUDIO__EDMA0, i) & (uint32_t)kEDMA_InterruptFlag) != 0U)
            {
                EDMA_HandleIRQ(s_EDMAHandle[prevChannel + i]);
            }
        }
    }
    SDK_ISR_EXIT_BARRIER;
}
#endif

#ifdef AUDIO__EDMA1
void AUDIO_EDMA1_INT_DriverIRQHandler(void);
void AUDIO_EDMA1_INT_DriverIRQHandler(void)
{
    uint32_t channel = FSL_FEATURE_EDMA_MODULE_CHANNEL;
    uint32_t i = 0;
    DMA_Type *base = AUDIO__EDMA1;
    uint32_t instance = EDMA_GetInstance(base);
    uint32_t prevChannel = (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL * instance;

#if defined FSL_FEATURE_EDMA_INSTANCE_CHANNELn
    channel = (uint32_t)FSL_FEATURE_EDMA_INSTANCE_CHANNELn(base);
#endif
    for (i = 0; i < channel; i++)
    {
        if (s_EDMAEnabledChannel[instance][i])
        {
            if ((EDMA_GetChannelStatusFlags(AUDIO__EDMA1, i) & (uint32_t)kEDMA_InterruptFlag) != 0U)
            {
                EDMA_HandleIRQ(s_EDMAHandle[prevChannel + i]);
            }
        }
    }
    SDK_ISR_EXIT_BARRIER;
}
#endif

#ifdef DMA__EDMA0
void DMA_EDMA0_INT_DriverIRQHandler(void);
void DMA_EDMA0_INT_DriverIRQHandler(void)
{
    uint32_t channel = FSL_FEATURE_EDMA_MODULE_CHANNEL;
    uint32_t i = 0;
    DMA_Type *base = DMA__EDMA0;
    uint32_t instance = EDMA_GetInstance(base);
    uint32_t prevChannel = (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL * instance;

#if defined FSL_FEATURE_EDMA_INSTANCE_CHANNELn
    channel = (uint32_t)FSL_FEATURE_EDMA_INSTANCE_CHANNELn(base);
#endif
    for (i = 0; i < channel; i++)
    {
        if (s_EDMAEnabledChannel[instance][i])
        {
            if ((EDMA_GetChannelStatusFlags(DMA__EDMA0, i) & (uint32_t)kEDMA_InterruptFlag) != 0U)
            {
                EDMA_HandleIRQ(s_EDMAHandle[prevChannel + i]);
            }
        }
    }
    SDK_ISR_EXIT_BARRIER;
}
#endif

