martin8947/mcux_stage/mcxw_stage/drivers/fsl_edma.c
#ifdef DMA__EDMA1
void DMA_EDMA1_INT_DriverIRQHandler(void);
void DMA_EDMA1_INT_DriverIRQHandler(void)
{
    uint32_t channel = FSL_FEATURE_EDMA_MODULE_CHANNEL;
    uint32_t i = 0;
    DMA_Type *base = DMA__EDMA1;
    uint32_t instance = EDMA_GetInstance(base);
    uint32_t prevChannel = (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL * instance;

#if defined FSL_FEATURE_EDMA_INSTANCE_CHANNELn
    channel = (uint32_t)FSL_FEATURE_EDMA_INSTANCE_CHANNELn(base);
#endif
    for (i = 0; i < channel; i++)
    {
        if (s_EDMAEnabledChannel[instance][i])
        {
            if ((EDMA_GetChannelStatusFlags(DMA__EDMA1, i) & (uint32_t)kEDMA_InterruptFlag) != 0U)
            {
                EDMA_HandleIRQ(s_EDMAHandle[prevChannel + i]);
            }
        }
    }
    SDK_ISR_EXIT_BARRIER;
}
#endif

#ifdef CONNECTIVITY__EDMA
void CONNECTIVITY__EDMA_INT_DriverIRQHandler(void);
void CONNECTIVITY__EDMA_INT_DriverIRQHandler(void)
{
    uint32_t channel = FSL_FEATURE_EDMA_MODULE_CHANNEL;
    uint32_t i = 0;
    DMA_Type *base = CONNECTIVITY__EDMA;
    uint32_t instance = EDMA_GetInstance(base);
    uint32_t prevChannel = (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL * instance;

#if defined FSL_FEATURE_EDMA_INSTANCE_CHANNELn
    channel = (uint32_t)FSL_FEATURE_EDMA_INSTANCE_CHANNELn(base);
#endif
    for (i = 0; i < channel; i++)
    {
        if (s_EDMAEnabledChannel[instance][i])
        {
            if ((EDMA_GetChannelStatusFlags(base, i) & (uint32_t)kEDMA_InterruptFlag) != 0U)
            {
                EDMA_HandleIRQ(s_EDMAHandle[prevChannel + i]);
            }
        }
    }
}
#endif

#ifdef EDMA1
void EDMA1_0_15_DriverIRQHandler(void);
void EDMA1_0_15_DriverIRQHandler(void)
{
    uint32_t channel = FSL_FEATURE_EDMA_MODULE_CHANNEL;
    uint32_t i = 0;
    DMA_Type *base = EDMA1;
    uint32_t instance = EDMA_GetInstance(base);
    uint32_t prevChannel = (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL * instance;

#if defined FSL_FEATURE_EDMA_INSTANCE_CHANNELn
    channel = (uint32_t)FSL_FEATURE_EDMA_INSTANCE_CHANNELn(base);
#endif

    for (i = 0; i < channel; i++)
    {
        if (s_EDMAEnabledChannel[instance][i])
        {
            if ((EDMA_GetChannelStatusFlags(base, i) & (uint32_t)kEDMA_InterruptFlag) != 0U)
            {
                EDMA_HandleIRQ(s_EDMAHandle[prevChannel + i]);
            }
        }
    }

/* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate
  overlapping
  exception return operation might vector to incorrect interrupt */
    SDK_ISR_EXIT_BARRIER;
}

void EDMA1_16_31_DriverIRQHandler(void);
void EDMA1_16_31_DriverIRQHandler(void)
{
    uint32_t channel = FSL_FEATURE_EDMA_MODULE_CHANNEL;
    uint32_t i = 0;
    DMA_Type *base = EDMA1;
    uint32_t instance = EDMA_GetInstance(base);
    uint32_t prevChannel = (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL * instance;

#if defined FSL_FEATURE_EDMA_INSTANCE_CHANNELn
    channel = (uint32_t)FSL_FEATURE_EDMA_INSTANCE_CHANNELn(base);
#endif

    for (i = 0; i < channel; i++)
    {
        if (s_EDMAEnabledChannel[instance][i])
        {
            if ((EDMA_GetChannelStatusFlags(base, i) & (uint32_t)kEDMA_InterruptFlag) != 0U)
            {
                EDMA_HandleIRQ(s_EDMAHandle[prevChannel + i]);
            }
        }
    }

/* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate
  overlapping
  exception return operation might vector to incorrect interrupt */
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif
